modm-ext/data.modm.io/docs/svd/header_stm32l100xb.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="COMP">
      <name>COMP2</name>
      <description>Comparator</description>
      <groupName>COMP</groupName>
      <baseAddress>0x40007c01</baseAddress>
    </peripheral>
    <peripheral>
      <name>RI</name>
      <description>Routing Interface</description>
      <groupName>RI</groupName>
      <baseAddress>0x40007c04</baseAddress>
      <registers>
        <register>
          <name>ICR</name>
          <description>RI input capture register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IC1OS</name>
              <description>IC1OS[3:0] bits (Input Capture 1 select bits)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>IC2OS</name>
              <description>IC2OS[3:0] bits (Input Capture 2 select bits)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>IC3OS</name>
              <description>IC3OS[3:0] bits (Input Capture 3 select bits)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>IC4OS</name>
              <description>IC4OS[3:0] bits (Input Capture 4 select bits)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TIM</name>
              <description>TIM[3:0] bits (Timers select bits)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>IC1</name>
              <description>Input capture 1</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC2</name>
              <description>Input capture 2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC3</name>
              <description>Input capture 3</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC4</name>
              <description>Input capture 4</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ASCR1</name>
          <description>RI analog switches control register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH</name>
              <description>AS_CH[25:18] &amp; AS_CH[15:0] bits ( Analog switches selection bits)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>CH_16</name>
              <description>AS_CH[25:18] &amp; AS_CH[15:0] bits ( Analog switches selection bits)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>VCOMP</name>
              <description>ADC analog switch selection for internal node to COMP1</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SCM</name>
              <description>I/O Switch control mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ASCR2</name>
          <description>RI analog switch control register 2</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GR6</name>
              <description>GR6 selection bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HYSCR1</name>
          <description>RI hysteresis control register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PA</name>
              <description>PA[15:0] Port A Hysteresis selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>PB</name>
              <description>PB[15:0] Port B Hysteresis selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HYSCR2</name>
          <description>RI Hysteresis control register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PC</name>
              <description>PC[15:0] Port C Hysteresis selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>PD</name>
              <description>PD[15:0] Port D Hysteresis selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HYSCR3</name>
          <description>RI Hysteresis control register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PE</name>
              <description>PE[15:0] Port E Hysteresis selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
